In [36]:
import pandas as pd

In [37]:
input_file = 'supplier_data.csv'
output_file = 'output/3output_basic.csv'

In [38]:
df_supplier = pd.read_csv(input_file)
df_supplier

   Supplier Name Invoice Number  Part Number     Cost Purchase Date
0     Supplier X       001-1001         2341  $500.00       1/20/14
1     Supplier X       001-1001         2341  $500.00       1/20/14
2     Supplier X       001-1001         5467  $750.00       1/20/14
3     Supplier X       001-1001         5467  $750.00       1/20/14
4     Supplier Y        50-9501         7009  $250.00       1/30/14
5     Supplier Y        50-9501         7009  $250.00       1/30/14
6     Supplier Y        50-9505         6650  $125.00        2/3/14
7     Supplier Y        50-9505         6650  $125.00        2/3/14
8     Supplier Z       920-4803         3321  $610.00        2/3/14
9     Supplier Z       920-4804         3321  $615.00       2/10/14
10    Supplier Z       920-4805         3321  $615.00       2/17/14
11    Supplier Z       920-4806         3321  $615.00       2/24/14

# 문제 : Purchase Date가 1/20/14인 행을 검색하고 그중 마지막 두개행을 출력하라

In [39]:
result1 = df_supplier.loc[df_supplier['Purchase Date'] == '1/20/14', : ]
result1

  Supplier Name Invoice Number  Part Number     Cost Purchase Date
0    Supplier X       001-1001         2341  $500.00       1/20/14
1    Supplier X       001-1001         2341  $500.00       1/20/14
2    Supplier X       001-1001         5467  $750.00       1/20/14
3    Supplier X       001-1001         5467  $750.00       1/20/14

In [40]:
result1.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [41]:
result2 = a[a.index > 1]
result2

  Supplier Name Invoice Number  Part Number     Cost Purchase Date
2    Supplier X       001-1001         5467  $750.00       1/20/14
3    Supplier X       001-1001         5467  $750.00       1/20/14